Pandas is a open source library built on top of Numpy. It allows for fast analysis and data cleaning and preperation. It excels in performance and productivity. It also has built in data visualization features and can work with data from a variety of sources.

# Pandas
## Series

series are very similar to numPy arrays, infact they are built on top of them. However they are unique in that they support access labels meaning they can be indexed by a label

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

When using pd.Series it takes in a wide variety of parameters but the two most important are data and index.

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

Notice how the index is distinguished from the data

In [4]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

Now we were able to change the indexes to what we want. We labeled the index.

In [5]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

You don't have to specify what the value you are passing in corresponds to each time because of the order it is placed in.

In [6]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

Passing in a numPy array or a list is basically like the same thing in terms of what is does. There is no difference

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

Passing in a dictionary will let you do the process of labelling and assign data its values at the same time.

In [8]:
pd.Series(data = [len,print,map,sum])

0      <built-in function len>
1    <built-in function print>
2                <class 'map'>
3      <built-in function sum>
dtype: object

Series are also different in that they can hold many different kinds of objects, including built-in functions

Pandas can make use of the index names by allowing for very fast lookups of information and it works just like a hashtable or a dictionary. In terms of using it you would simply get data from it just like a dictionary.

In [9]:
ser1 = pd.Series([1,2,3,4], ["USA", "Germany", "USSR", "Japan"])
ser2 = pd.Series([1,2,5,4], ["USA", "Germany", "Italy", "Japan"])

In [10]:
ser1['USA']

1

When adding two of them together it will take the common label and add it corresponding values and set a NAN value for labels that only one of them has. See below to clarify

In [11]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

You are allowed to have indexes be the same however when you try to reference those repeated indexes you will get a Series object back

In [12]:
pd.Series([1,2,3,4], [0,0,0,1])[0]

0    1
0    2
0    3
dtype: int64

In [13]:
type(pd.Series([1,2,3,4], [0,0,0,1])[0])

pandas.core.series.Series

## DataFrames

In [14]:
from numpy.random import randn

In [15]:
np.random.seed(101)

In [16]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ["W","X","Y","Z"])

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

A data frame is basically a bunch of series with similar indexes. Over Here W,X,Y and Z are all series and A,B,C,D and E are all indexes. To take something from the dataframe you can use the brackets and continue

In [18]:
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

Once again, the reason this looks like a series object is because it is a series object

In [19]:
type(df["W"])

pandas.core.series.Series

To get multiple columns just put them in brackets

In [20]:
df[["W","X"]]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

To add a new column you can simply assign to math performed on other columns. See below to understand better

In [21]:
df['new'] = df["W"]+df["Y"]
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

To remove stuff you can use the drop() method. Remember to specify your axis. For example when removing the new column you need to use axis = 1 because the default axis is 0 and that refers to the labels.

In [22]:
df.drop("new", axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Be careful though! Remember that drop() doesn't occur in place. That is why df still shows the other thing. As with many other methods in the pandas library stuff doesn't happen in place so that you don't accidentally lose information. You can set inplace to equal True to make this happen in place.

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df.drop("new", axis = 1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df.drop("E", axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

the shape attribute is the same for dataframes. (number of rows, number of columns)

In [26]:
print(df.shape)
df

(5, 4)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

You can also call rows by the following 2 ways:

loc[ ] (notice the square brackets) this works because not only are the columns series but the rows are too.

iloc[ ] (same square bracket deal) with this one you have to count the index instead

In [27]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [28]:
df.loc[['B','A']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
A  2.706850  0.628133  0.907969  0.503826

In [29]:
df.iloc[[1,3]]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

You can also choose between both by using the format
[row,col] in loc

In [30]:
df.loc['C','W']

-2.018168244037392

In [31]:
df.loc[['A','B'],["W","Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

As you might recall from numPy, conditional selection is when you change each value of an object to a boolean based on whether it satisfies a condition or not. When you pass that in to the original dataframe you will get another one with NaNs where it is False and the value where it is true

In [32]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [33]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

Of course you can skip all of this and just do it in one line

In [34]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

However this is not how it is usually used. You only get the NaN values when you pass in an entire dataframe. Instead you would usually just pass in a series and that would let you filter out rows that you didn't want. See below for an example. Because only row D,E did satisfy the condition they were allowed to pass

In [35]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

What if you wanted to have multiple conditions, such as column W is greater than 0 and column Z is greater than 1. You might try the following

In [36]:
try:
    df[(df['W']>0) and (df["Z"]>1)]
except ValueError:
    print("The reason this doesn't work is because the and comparator can only compare boolean values like True and False")
    print("It cannot compare a Series of booleans with another one.")

The reason this doesn't work is because the and comparator can only compare boolean values like True and False
It cannot compare a Series of booleans with another one.

Because of this you will have to use an & sign to compare multiple values as and would.

In [37]:
df[(df['W']>0) & (df["Z"]>0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

To use or just use this sign |

In [38]:
df[(df['W']>0) | (df['Z']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Indexing

In order to turn the indexes back into whole numbers you can use reset_index(). This will also make your old index become a column of the dataframe thereby also changing the shape. This one also occurs out of place so you have to use inplace = True to make it happen in place.

In [39]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [43]:
print(df.reset_index().shape)
print(df.shape)

(5, 5)
(5, 4)

If you desire for one of the columns of your dataframe to become the new indexes you can use set_index() instead. This will reduce the shape down one column, as that column is now going to be the indexes. The inplace stuff is the same. Remember however that if you do do this inplace then you will forever lose the previous indexes. To 
demonstrate I will first add a new column and then perform the operation.

In [47]:
df['States'] = "CA NY WY OR CO".split()
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [49]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [50]:
print(df.set_index('States').shape)
print(df.shape)

(5, 4)
(5, 5)

### Multi-Index and  Index Hierarchy

To start we will create our own dataframe. Don't worry about the code below, it is just setting up what is about to come.

In [51]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

To grab data now you can simply grab from the outermost index first, to get a sub dataframe and then act on that one

In [53]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [54]:
df.loc['G1'].loc[1, 'A']

0.3026654485851825

You should also name your layers with df.index.names

In [55]:
df.index.names = ['Group','Num']
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

The xs method grants you access to cross sections

In [58]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

It is much more useful though. Because of its ability to see inside the multi-indexed heirarchy you can also do something like grab all the values in row 1 for G1 and G2. This is where naming the indexes comes in handy

In [59]:
df.xs(1, level = "Num")

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

## Missing Data

Sometimes when pandas is retrieving data from other sources it will encounter areas that are not filled. In those spots it will put in a Nan argument. Pandas provides many methods for handling these Nans. 

First off we will create the dataframe with the missing information by inserting in a dictionary.

In [49]:
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan], 'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

There is a method called dropna(). When called without any argument it will take out any row that has 1 or more NaN values in it

In [50]:
df.dropna()

     A    B  C
0  1.0  5.0  1

There is a variable called axis which you can set to 1 to get rid of columns instead of rows

In [51]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

You can also specify a threshold which makes it so that you need a certain number of non-Nan's to be dropped. By letting thresh equal 2 you make it so that only every row with 2 or more normal values will get kept

In [52]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

Intstead of dropping you can also use fillna() to fill NaN's with values of your choice. You must specify the value by attributing value to something

In [53]:
df.fillna(value="FILLNA")

        A       B  C
0       1       5  1
1       2  FILLNA  2
2  FILLNA  FILLNA  3

However, you can also fill in values that make more stastical sense. For example, if you wanted to fill the NaN in column A with the mean of that column you can just do the following:

In [54]:
df['A'].fillna(value=df['A'].mean(), inplace = True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

## Groupby

You can use the groupby method to call groups of rows based off of columns and then perform aggregate functions on them

In [55]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)

In [56]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

By using groupby you create a groupby object. You can then store that in a variable and call methods off of it

In [57]:
by_comp = df.groupby("Company")
by_comp

In [58]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

The reason you can't see the Person column is because it is a string so you can't take it's average. This does however show how groupby will deal with any exception by itself!

In [59]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [60]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

Because they each return dataframes you can then perform operations on them.

In [61]:
by_comp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

Other useful functions:

count() will tell you the number of instances of each thing

max()/min() will tell you the max/min of each thing. It can also work with strings because they are alphabetized 

describe() will give you a lot of information on each thing.

In [62]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [63]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [64]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

By adding .transpose() you just make the companys become columns instead

In [65]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Merging, Joining, and Concatenating

We will start off with three different data frames. And then we will just combine them using concatination

In [66]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [67]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [68]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [69]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

With concatination you just glue together the dataframes. The default axis is 0, AKA it will join the rows together. The dimensions must match when you do this. The method itself is pd.concat

In [70]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [71]:
pd.concat([df1,df2,df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

Here you get all the empty values because this time you don't have the data needed. Since now you are joining the columns and the labels of the rows aren't the same it creates this 9 by 9 grid filled with Nan's. This demonstrates the importance of lining up information correctly on the axis

Next we will create some more example datatables

In [72]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [73]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [74]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

To merge two dataframes all you do is use the merge function. The first to arguments are your left and right dataframes and then you specify the how which is defaulted to an inner join but can be specified to outer left or right, and the on specifies what columns you are joining on. An explanation of the four joins: inner takes elements only found in both dfs; left takes all elements of the left df and what matches from the right; right is the same but for the right df; outer takes in all elements. 
The on key specifies what columns to compare/ merge on.

In [75]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Some more dataframes...

In [76]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [77]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [78]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

You can also put in a list of columns for the on argument. Now it works by comparing to see if both keys match. In addition, it checks each pair of keys to the original - this is demonstrated on the bottom when K1 K0 matches with rows making it include both

In [79]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [80]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [81]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [82]:
pd.merge(left,right, how = "left", on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Joining is almost the same but you join off of indexes instead and you call it from a dataframe

In [83]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [84]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [85]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [86]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [87]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Other Operations

In [11]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2":[444,555,666,444], "col3":['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

If you want to find out what unique values are present in your dataframe. There are three things that deal with this area.

1. (series).unique() => A method of the Series object, will return a numpy array containing all the unique values
    - Going off of this, applying the len function will return a count of the number of unique values in a column
2. (series).nunique() => You could do that or you could use this method instead
3. (series).value_counts() => This will return a Series with the unique values as indexes, and their counts as datapoints.

In [13]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [14]:
len(df['col2'].unique())

3

In [15]:
df['col2'].nunique()

3

In [16]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Series also has a really cool apply method. This will allow you to broadcast one of your own functions on the entire dataset

In [18]:
#Multiplying everything by two
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [21]:
#Applying logic to the dataframe itself by applying logic to the datapoints!
df[df['col2'].apply(lambda x: x>=555)]

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [22]:
#Using built-in functions 
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

A little bit of revision here but the columns names and index names are stored as attributes of a dataframe

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

If you want to sort your dataframe you can use:
1. (DataFrame).sort_values(...) => this can take in a bunch of different parameters however "by" matters the most, you must specify what column or row you are using. (use axis to specify the axis as well). Note how index information is preserved

2. (DataFrame).head(n) => will display the first n rows of the df. If nothing is specified it will just show that df itself

In [29]:
#You don't need "by=" but this is here for clarity
df.sort_values(by = "col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [30]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

To find null values you can use:
1. (DataFrame).isnull() => will return a dataframe with datapoints being replaced by boolean values specifying whether the data points or null or not

In [31]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

Finally we shall talk about making pivot tables: (check the link for more info: https://www.deskbright.com/excel/what-is-a-pivot-table/)

First we create the DataFrame

In [32]:
df =  pd.DataFrame({'A':["foo", "foo", "foo", "bar", "bar", "bar"], 
                     'B':["one", "one", "two", "two", "one", "one"], 
                     'C':["x", "y", "x", "y", "x", "y"], 
                     'D':[1,3,2,5,4,1]})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

Now we will use:
1. (DataFrame).pivot_table(values = None, index = None, columns = None,...) => This function will create a multi-indexed dataframe based on the argument you give. The three main arguments are above
    - values: can be a list or just a string by itself; this becomes the datapoints of the new dataframe
    - index: can be a list or just a string by itself; this becomes the multi-indexed list of the new dataframe
    - columns: can be a list or just a string by itself; this becomes the columns of the new dataframe

In [33]:
df.pivot_table(values = 'D', index = ['A', "B"], columns = "C")
#The NaNs come because no values exist for those specific index-column pairs.

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [34]:
df.pivot_table('D', ['C', 'A'], 'B')

B      one  two
C A
x bar  4.0  NaN
  foo  1.0  2.0
y bar  1.0  5.0
  foo  3.0  NaN

## Reading/Writing to files

Just a note: Press tab after writing the first part of either method to see all file formats Pandas can handle

We first look at csv files. CSV stands for Comma Separated Values. Quite simply, it is a file with its values seperated by commas. Check out https://www.computerhope.com/issues/ch001356.htm for more information. 

On to the CSV reading! To read from it you just need to use:
1. (Pandas).read_csv(filepath,...) => This will read the csv file into a data frame. filepath is obviously the filepath of the csv. To find somemore values you can specify check out: https://www.listendata.com/2019/06/pandas-read-csv.html

To write to it you can use:
1. (DataFrame).to_csv(filename,...) => This will convert the data frame into a csv. filepath still is the filepath. For other arguments check out https://stackoverflow.com/questions/16923281/writing-a-pandas-dataframe-to-csv-file, there is a response with a table containing every other argument. Here we used index = False to drop the index

In [42]:
df = pd.read_csv('Pandas_CSV')

In [39]:
df

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  12  15  16

In [24]:
df.to_csv('Pandas_CSV', index=False)

Next we look at Excel files. 

See https://www.pybloggers.com/2018/11/pandas-excel-tutorial-how-to-read-and-write-excel-files/ for everything else here is a summary:

When reading from an excel file functions will not be copied and images or macros could also cause Pandas to crash. That being said all you need to do is:
1. (Pandas).read_excel(filename, sheet_name,...) => this will take an excel file and convert to a dataframe. The sheet_name specifies what sheet you are using and filename is the name of the file

To write to an excel file you just use:
1. (Pandas).to_excel(filename, sheet_name,...) => this will write an excel file given a dataframe. both arguments are the same as above. Note that index = False is used to prevent the indexes from being copied.

In [46]:
df = pd.read_excel('Pandas_Excel.xlsx', sheet_name='Sheet1')

In [47]:
df

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  12  15  16

In [48]:
df.to_excel('Pandas_Excel.xlsx', sheet_name='Sheet1', index=False)

Finally we see how to transfer data from html input. You first use:
1. (Pandas).read_html(link) => Returns a list of dataframes given the link of the site. The reason for the list of data frames is that a list is created everytime a table element is run into.

In [49]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [50]:
print(len(df))

1

In [51]:
type(df)

list

In [53]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

#### NOTE: TO SEE HOW TO DEAL WITH SQL TABLES CHECK THE COURSE. IT IS RECOMMEDED TO USE OTHER LIBRARIES HOWEVER